
export const tagConfig = [
  {
    color: '#EDBA34',
    name: '金融',
    id: 'OT01'
  },
  {
    color: '#EDBA34',
    name: '银行',
    id: 'OT0101'
  },
  {
    color: '#EDBA34',
    name: '政策性银行',
    id: 'OT010101'
  },
  {
    color: '#EDBA34',
    name: '六大行',
    id: 'OT010102'
  }, {
    color: '#8074F2',
    name: '农商行',
    id: 'XY060104'
  }, {
    color: '#8074F2',
    name: '城商行',
    id: 'XY060105'
  },
  {
    color: '#EDBA34',
    name: '股份制银行',
    id: 'OT010103'
  },
  {
    color: '#EDBA34',
    name: '农商行',
    id: 'OT010104'
  },
  {
    color: '#EDBA34',
    name: '城商行',
    id: 'OT010105'
  },
  {
    color: '#EDBA34',
    name: '其他银行',
    id: 'OT010199'
  },
  {
    color: '#EDBA34',
    name: '保险',
    id: 'OT0102'
  },
  {
    color: '#EDBA34',
    name: '保险集团',
    id: 'OT010201'
  },
  {
    color: '#EDBA34',
    name: '财险',
    id: 'OT010202'
  },
  {
    color: '#EDBA34',
    name: '寿险',
    id: 'OT010203'
  },
  {
    color: '#EDBA34',
    name: '再保险',
    id: 'OT010204'
  },
  {
    color: '#EDBA34',
    name: '养老险',
    id: 'OT010205'
  },
  {
    color: '#EDBA34',
    name: '健康险',
    id: 'OT010206'
  },
  {
    color: '#EDBA34',
    name: '其他保险',
    id: 'OT010299'
  },
  {
    color: '#EDBA34',
    name: '信用社',
    id: 'OT0103'
  },
  // {
  //   color: '#8074F2',name: '信用社',
  //   id: 'OT010301'
  // },
  {
    color: '#EDBA34',
    name: '证券',
    id: 'OT0104'
  },
  {
    color: '#EDBA34',
    name: '券商',
    id: 'OT010401'
  },
  {
    color: '#EDBA34',
    name: '期货',
    id: 'OT010402'
  },
  {
    color: '#EDBA34',
    name: '其他',
    id: 'OT010499'
  },
  {
    color: '#EDBA34',
    name: '政府',
    id: 'OT02'
  },
  {
    color: '#EDBA34',
    name: '医疗',
    id: 'OT03'
  },
  {
    color: '#EDBA34',
    name: '教育',
    id: 'OT04'
  },
  {
    id: 'P100000',
    name: '系统集成资质',
    color: '#8074F2'
  },
  {
    id: 'P200000',
    name: '运行维护资质',
    color: '#8074F2'
  },
  {
    id: 'XY0101',
    name: '厂商',
    color: '#49C3E5'
  },
  {
    id: 'XY0102',
    name: '经销商',
    color: '#49C3E5'
  },
  {
    id: 'XY0104',
    name: '电商',
    color: '#49C3E5'
  },
  {
    id: 'XY0103',
    name: '品牌',
    color: '#7FC334'
  },
  {
    id: 'XY0201',
    name: '知名',
    color: '#48A4F9'
  },
  {
    id: 'XY0202',
    name: '艾媒金榜',
    color: '#48A4F9'
  },
  {
    id: 'XY0203',
    name: '爱分析',
    color: '#48A4F9'
  },
  {
    id: 'XY0204',
    name: '互联网周刊',
    color: '#48A4F9'
  },
  {
    id: 'XY0205',
    name: 'gartner',
    color: '#48A4F9'
  },
  {
    id: 'XY0301',
    name: '全国性',
    color: '#F39A57'
  },
  {
    id: 'XY0302',
    name: '地域性',
    color: '#F39A57'
  },
  {
    id: 'FW03',
    name: '医疗',
    color: '#35C876'
  },
  {
    id: 'FW0301',
    name: '医疗',
    color: '#35C876'
  },
  {
    id: 'FW02',
    name: '政府',
    color: '#35C876'
  },
  {
    id: 'FW04',
    name: '教育',
    color: '#35C876'
  },
  {
    id: 'FW0401',
    name: '教育',
    color: '#35C876'
  },
  {
    id: 'FW010299',
    name: '其他保险',
    color: '#35C876'
  },
  // {
  //   id: 'FW010301',
  //   name: '信用社',
  //   color: '#35C876',
  // },
  {
    id: 'FW0104',
    name: '证券',
    color: '#35C876'
  },
  {
    id: 'FW010401',
    name: '券商',
    color: '#35C876'
  },
  {
    id: 'FW010499',
    name: '其他',
    color: '#35C876'
  },
  {
    id: 'FW010402',
    name: '期货',
    color: '#35C876'
  },
  {
    id: 'FW010403',
    name: '基金',
    color: '#35C876'
  },
  {
    id: 'FW0103',
    name: '信用社',
    color: '#35C876'
  },
  {
    id: 'FW010206',
    name: '健康险',
    color: '#35C876'
  },
  {
    id: 'FW010205',
    name: '养老险',
    color: '#35C876'
  },
  {
    id: 'FW010204',
    name: '再保险',
    color: '#35C876'
  },
  {
    id: 'FW010203',
    name: '寿险',
    color: '#35C876'
  },
  {
    id: 'FW010202',
    name: '财险',
    color: '#35C876'
  },
  {
    id: 'FW010201',
    name: '保险集团',
    color: '#35C876'
  },
  {
    id: 'FW0102',
    name: '保险',
    color: '#35C876'
  }, {
    id: 'FW01',
    name: '金融',
    color: '#35C876'
  },
  {
    id: 'FW0101',
    name: '银行',
    color: '#35C876'
  },
  {
    id: 'FW010101',
    name: '政策性银行',
    color: '#35C876'
  },
  {
    id: 'FW010102',
    name: '六大行',
    color: '#35C876'
  },
  {
    id: 'FW010103',
    name: '股份制银行',
    color: '#35C876'
  },
  {
    id: 'FW010104',
    name: '农商行',
    color: '#35C876'
  },
  {
    id: 'FW010105',
    name: '城商行',
    color: '#35C876'
  },
  {
    id: 'FW010199',
    name: '其他银行',
    color: '#35C876'
  },
  {
    order: '1',
    id: 'XY0401',
    name: '政府',
    color: '#35C876'
  },
  {
    order: '1',
    id: 'XY0703',
    name: '金额公开',
    color: '#35C876'
  },
  // {
  //   order: '2',
  //   id: 'XY0402',
  //   name: '金融',
  //   color: '#35C876',
  // },
  {
    order: '3',
    id: 'XY0403',
    name: '医疗',
    color: '#35C876'
  },
  {
    order: '4',
    id: 'XY0404',
    name: '教育',
    color: '#35C876'
  },
  {
    id: 'XY0501',
    name: '国有',
    color: '#E27D7D'
  },
  {
    id: 'XY0502',
    name: '外资',
    color: '#E27D7D'
  },
  {
    id: 'XY0503',
    name: '上市',
    color: '#CA82D6'
  },
  {
    id: 'XY0504',
    name: '瞪羚企业',
    color: '#CA82D6'
  },
  {
    id: 'XY0505',
    name: '高新技术企业',
    color: '#CA82D6'
  },
  {
    id: 'XY0507',
    name: '注销',
    color: 'rgba(51,51,51,0.7)'
  },
  {
    id: 'XY0506',
    name: '科技型中小企业',
    color: '#CA82D6'
  },
  {
    id: 'XY0701',
    name: '单一来源',
    color: '#4C66EC'
  },
  {
    id: 'XY0702',
    name: '成交',
    color: '#4C66EC'
  },

  {
    color: '#43C7C8',
    id: 'Q100000',
    name: '工程勘察'
  },
  {
    color: '#43C7C8',
    id: 'Q101000',
    name: '工程勘察综合资质'
  },
  {
    color: '#43C7C8',
    id: 'Q102000',
    name: '工程勘察专业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q102010',
    name: '工程勘察岩土工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102011',
    name: '工程勘察岩土工程专业（岩土工程勘察）'
  },
  {
    color: '#43C7C8',
    id: 'Q102012',
    name: '工程勘察岩土工程专业（岩土工程设计）'
  },
  {
    color: '#43C7C8',
    id: 'Q102013',
    name: '工程勘察岩土工程专业（岩土工程物探测试检测监测）'
  },
  {
    color: '#43C7C8',
    id: 'Q102020',
    name: '工程勘察水文地质勘察专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102030',
    name: '工程勘察工程测量专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102040',
    name: '工程勘察海洋工程勘察专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102041',
    name: '工程勘察海洋工程勘察专业（海洋工程测量）'
  },
  {
    color: '#43C7C8',
    id: 'Q102042',
    name: '工程勘察海洋工程勘察专业（海洋岩土工程勘察）'
  },
  {
    color: '#43C7C8',
    id: 'Q102043',
    name: '工程勘察海洋工程勘察专业（海洋工程环境调查）'
  },
  {
    color: '#43C7C8',
    id: 'Q103000',
    name: '工程勘察劳务资质'
  },
  {
    color: '#43C7C8',
    id: 'Q103010',
    name: '工程勘察工程钻探劳务'
  },
  {
    color: '#43C7C8',
    id: 'Q103020',
    name: '工程勘察凿井劳务'
  },
  {
    color: '#43C7C8',
    id: 'Q200000',
    name: '工程设计'
  },
  {
    color: '#43C7C8',
    id: 'Q201000',
    name: '工程设计综合资质'
  },
  {
    color: '#43C7C8',
    id: 'Q202000',
    name: '工程设计行业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q202010',
    name: '工程设计煤炭行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202020',
    name: '工程设计化工石化医药行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202030',
    name: '工程设计石油天然气（海洋石油）行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202040',
    name: '工程设计电力行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202050',
    name: '工程设计冶金行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202060',
    name: '工程设计军工行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202070',
    name: '工程设计机械行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202080',
    name: '工程设计商物粮行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202090',
    name: '工程设计核工业行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202100',
    name: '工程设计电子通信广电行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202101',
    name: '工程设计电子通信广电行业（电子工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202102',
    name: '工程设计电子通信广电行业（通信工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202103',
    name: '工程设计电子通信广电行业（广电工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202110',
    name: '工程设计轻纺行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202111',
    name: '工程设计轻纺行业（轻工工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202112',
    name: '工程设计轻纺行业（纺织工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202120',
    name: '工程设计建材行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202130',
    name: '工程设计铁道行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202140',
    name: '工程设计公路行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202150',
    name: '工程设计水运行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202160',
    name: '工程设计民航行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202170',
    name: '工程设计市政行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202171',
    name: '工程设计市政行业（燃气工程、轨道交通工程除外）'
  },
  {
    color: '#43C7C8',
    id: 'Q202180',
    name: '工程设计农林行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202181',
    name: '工程设计农林行业（农业工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202182',
    name: '工程设计农林行业（林业工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202190',
    name: '工程设计水利行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202200',
    name: '工程设计海洋行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202210',
    name: '工程设计建筑行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203000',
    name: '工程设计专业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q203010',
    name: '工程设计煤炭行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203011',
    name: '工程设计煤炭行业矿井专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203012',
    name: '工程设计煤炭行业露天矿专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203013',
    name: '工程设计煤炭行业选煤厂专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203020',
    name: '工程设计化工石化医药行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203021',
    name: '工程设计化工石化医药行业炼油工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203022',
    name: '工程设计化工石化医药行业化工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203023',
    name: '工程设计化工石化医药行业石油及化工产品储运专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203024',
    name: '工程设计化工石化医药行业化工矿山专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203025',
    name: '工程设计化工石化医药行业生化、生物药专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203026',
    name: '工程设计化工石化医药行业中成药专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203027',
    name: '工程设计化工石化医药行业化学原料药专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203028',
    name: '工程设计化工石化医药行业药物制剂专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203029',
    name: '工程设计化工石化医药行业医疗器械（含药品内包装）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203030',
    name: '工程设计石油天然气（海洋石油）行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203031',
    name: '工程设计石油天然气（海洋石油）行业油田地面专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203032',
    name: '工程设计石油天然气（海洋石油）行业气田地面专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203033',
    name: '工程设计石油天然气（海洋石油）行业管道输送专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203034',
    name: '工程设计石油天然气（海洋石油）行业海洋石油专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203035',
    name: '工程设计石油天然气（海洋石油）行业油气库专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203036',
    name: '工程设计石油天然气（海洋石油）行业油气加工专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203037',
    name: '工程设计石油天然气（海洋石油）行业石油机械制造与修理专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203040',
    name: '工程设计电力行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203041',
    name: '工程设计电力行业火力发电（含核电站常规岛设计）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203042',
    name: '工程设计电力行业水力发电（含抽水蓄能、潮汐）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203043',
    name: '工程设计电力行业风力发电专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203044',
    name: '工程设计电力行业送电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203045',
    name: '工程设计电力行业变电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203050',
    name: '工程设计冶金行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203051',
    name: '工程设计冶金行业金属冶炼工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203052',
    name: '工程设计冶金行业金属材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203053',
    name: '工程设计冶金行业焦化和耐火材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203054',
    name: '工程设计冶金行业冶金矿山工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203060',
    name: '工程设计军工行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203061',
    name: '工程设计军工行业导弹及火箭弹工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203062',
    name: '工程设计军工行业弹、火工品及固体发动机工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203063',
    name: '工程设计军工行业燃机、动力装置及航天发动机工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203064',
    name: '工程设计军工行业控制系统、光学、光电、电子、仪表工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203065',
    name: '工程设计军工行业科研、靶场、试验、教育培训工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203066',
    name: '工程设计军工行业地面设备工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203067',
    name: '工程设计军工行业航天空间飞行器工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203068',
    name: '工程设计军工行业运载火箭制造工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203069',
    name: '工程设计军工行业地面制导站工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306A',
    name: '工程设计军工行业航空飞行器工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306B',
    name: '工程设计军工行业机场工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306C',
    name: '工程设计军工行业船舶制造工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306D',
    name: '工程设计军工行业船舶机械工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306E',
    name: '工程设计军工行业船舶水工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306F',
    name: '工程设计军工行业坦克、装甲车辆工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306G',
    name: '工程设计军工行业枪、炮工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306H',
    name: '工程设计军工行业火、炸药工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203070',
    name: '工程设计机械行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203071',
    name: '工程设计机械行业通用设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203072',
    name: '工程设计机械行业专用设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203073',
    name: '工程设计机械行业交通运输设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203074',
    name: '工程设计机械行业电气机械设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203075',
    name: '工程设计机械行业金属制品业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203076',
    name: '工程设计机械行业仪器仪表及文化办公机械制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203077',
    name: '工程设计机械行业机械加工专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203078',
    name: '工程设计机械行业热加工专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203079',
    name: '工程设计机械行业表面处理专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20307A',
    name: '工程设计机械行业检测专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20307B',
    name: '工程设计机械行业物料搬运及仓储专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203080',
    name: '工程设计商物粮行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203081',
    name: '工程设计商物粮行业冷冻冷藏工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203082',
    name: '工程设计商物粮行业肉食品加工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203083',
    name: '工程设计商物粮行业批发配送与物流仓储工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203084',
    name: '工程设计商物粮行业成品油储运工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203085',
    name: '工程设计商物粮行业粮食工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203086',
    name: '工程设计商物粮行业油脂工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203090',
    name: '工程设计核工业行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203091',
    name: '工程设计核工业行业反应堆工程设计（含核电站反应堆工程）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203092',
    name: '工程设计核工业行业核燃料加工制造及处理工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203093',
    name: '工程设计核工业行业铀矿山及选冶工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203094',
    name: '工程设计核工业行业核设施退役及放射性三废处理处置工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203095',
    name: '工程设计核工业行业核技术及同位素应用工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203100',
    name: '工程设计电子通信广电行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203101',
    name: '工程设计电子通信广电行业电子整机产品项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203102',
    name: '工程设计电子通信广电行业电子基础产品项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203103',
    name: '工程设计电子通信广电行业显示器件项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203104',
    name: '工程设计电子通信广电行业微电子产品项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203105',
    name: '工程设计电子通信广电行业电子特种环境工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203106',
    name: '工程设计电子通信广电行业电子系统工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203107',
    name: '工程设计电子通信广电行业有线通信专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203108',
    name: '工程设计电子通信广电行业无线通信专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203109',
    name: '工程设计电子通信广电行业邮政工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310A',
    name: '工程设计电子通信广电行业通信铁塔专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310B',
    name: '工程设计电子通信广电行业广播电视中心专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310C',
    name: '工程设计电子通信广电行业广播电视发射专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310D',
    name: '工程设计电子通信广电行业广播电视传输专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310E',
    name: '工程设计电子通信广电行业电影工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310F',
    name: '工程设计电子通信广电行业无线通信专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310G',
    name: '工程设计电子通信广电行业邮政工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203110',
    name: '工程设计轻纺行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203111',
    name: '工程设计轻纺行业制浆造纸工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203112',
    name: '工程设计轻纺行业食品发酵烟草工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203113',
    name: '工程设计轻纺行业制糖工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203114',
    name: '工程设计轻纺行业日化及塑料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203115',
    name: '工程设计轻纺行业日用硅酸盐工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203116',
    name: '工程设计轻纺行业制盐及盐化工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203117',
    name: '工程设计轻纺行业皮革毛皮及制品专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203118',
    name: '工程设计轻纺行业家电电子及日用机械专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203119',
    name: '工程设计轻纺行业纺织工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311A',
    name: '工程设计轻纺行业印染工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311B',
    name: '工程设计轻纺行业服装工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311C',
    name: '工程设计轻纺行业化纤原料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311D',
    name: '工程设计轻纺行业化纤工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203120',
    name: '工程设计建材行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203121',
    name: '工程设计建材行业水泥工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203122',
    name: '工程设计建材行业玻璃、陶瓷、耐火材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203123',
    name: '工程设计建材行业新型建筑材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203124',
    name: '工程设计建材行业非金属矿及原料制备工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203125',
    name: '工程设计建材行业无机非金属材料及制品工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203130',
    name: '工程设计铁道行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203131',
    name: '工程设计铁道行业桥梁专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203132',
    name: '工程设计铁道行业轨道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203133',
    name: '工程设计铁道行业隧道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203134',
    name: '工程设计铁道行业电气化专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203135',
    name: '工程设计铁道行业通信信号专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203140',
    name: '工程设计公路行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203141',
    name: '工程设计公路行业公路专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203142',
    name: '工程设计公路行业特大桥梁专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203143',
    name: '工程设计公路行业特长隧道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203144',
    name: '工程设计公路行业交通工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203150',
    name: '工程设计水运行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203151',
    name: '工程设计水运行业港口工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203152',
    name: '工程设计水运行业航道工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203153',
    name: '工程设计水运行业通航建筑工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203154',
    name: '工程设计水运行业修造船厂水工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203155',
    name: '工程设计水运行业港口装卸工艺专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203156',
    name: '工程设计水运行业水上交通管制工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203160',
    name: '工程设计民航行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203161',
    name: '工程设计民航行业机场总体规划工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203162',
    name: '工程设计民航行业场道、目视助航工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203163',
    name: '工程设计民航行业通信、导航、航管及航站楼弱电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203164',
    name: '工程设计民航行业供油工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203170',
    name: '工程设计市政行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203171',
    name: '工程设计市政行业给水工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203172',
    name: '工程设计市政行业排水工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203173',
    name: '工程设计市政行业城镇燃气工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203174',
    name: '工程设计市政行业热力工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203175',
    name: '工程设计市政行业道路工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203176',
    name: '工程设计市政行业桥梁工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203177',
    name: '工程设计市政行业城市隧道工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203178',
    name: '工程设计市政行业公共交通工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203179',
    name: '工程设计市政行业载人索道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20317A',
    name: '工程设计市政行业轨道交通工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20317B',
    name: '工程设计市政行业环境卫生工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203180',
    name: '工程设计农林行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203181',
    name: '工程设计农林行业农业综合开发生态工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203182',
    name: '工程设计农林行业种植业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203183',
    name: '工程设计农林行业兽医/畜牧工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203184',
    name: '工程设计农林行业渔港/渔业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203185',
    name: '工程设计农林行业设施农业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203186',
    name: '工程设计农林行业林产工业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203187',
    name: '工程设计农林行业林产化学工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203188',
    name: '工程设计农林行业营造林工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203189',
    name: '工程设计农林行业森林资源环境工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20318A',
    name: '工程设计农林行业森林工业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203190',
    name: '工程设计水利行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203191',
    name: '工程设计水利行业水库枢纽专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203192',
    name: '工程设计水利行业引调水专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203193',
    name: '工程设计水利行业灌溉排涝专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203194',
    name: '工程设计水利行业河道整治专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203195',
    name: '工程设计水利行业城市防洪专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203196',
    name: '工程设计水利行业围垦专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203197',
    name: '工程设计水利行业水土保 持专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203198',
    name: '工程设计水利行业水文设施专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203200',
    name: '工程设计海洋行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203201',
    name: '工程设计海洋行业沿岸工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203202',
    name: '工程设计海洋行业离岸工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203203',
    name: '工程设计海洋行业海水利用专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203204',
    name: '工程设计海洋行业海洋能利用专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203210',
    name: '工程设计建筑行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203211',
    name: '工程设计建筑行业（建筑工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q203212',
    name: '工程设计建筑行业（人防工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q204000',
    name: '建筑工程设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q204010',
    name: '工程设计建筑设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q204020',
    name: '工程设计结构设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q204030',
    name: '工程设计机电设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q205000',
    name: '工程设计专项资质'
  },
  {
    color: '#43C7C8',
    id: 'Q205010',
    name: '工程设计建筑装饰工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205020',
    name: '工程设计建筑智能化系统专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205030',
    name: '工程设计建筑幕墙工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205040',
    name: '工程设计轻型钢结构工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205050',
    name: '工程设计风景园林工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205060',
    name: '工程设计消防设施工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205070',
    name: '工程设计环境工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205071',
    name: '工程设计环境工程专项（水污染防治工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205072',
    name: '工程设计环境工程专项（大气污染防治工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205073',
    name: '工程设计环境工程专项（固体废物处理处置工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205074',
    name: '工程设计环境工程专项（物理污染防治工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205075',
    name: '工程设计环境工程专项（污染修复工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205080',
    name: '工程设计照明工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q300000',
    name: '建筑业企业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q306000',
    name: '施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306010',
    name: '建筑工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306020',
    name: '公路工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306030',
    name: '铁路工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306040',
    name: '港口与航道工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306050',
    name: '水利水电工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306060',
    name: '电力工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306070',
    name: '矿山工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306080',
    name: '冶金工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306090',
    name: '石油化工工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306100',
    name: '市政公用工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306110',
    name: '通信工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306120',
    name: '机电工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307000',
    name: '专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307010',
    name: '地基基础工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307020',
    name: '起重设备安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307030',
    name: '预拌混凝土专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307040',
    name: '电子与智能化工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307050',
    name: '消防设施工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307060',
    name: '防水防腐保温工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307070',
    name: '桥梁工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307080',
    name: '隧道工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307090',
    name: '钢结构工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307100',
    name: '模板脚手架专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307110',
    name: '建筑装修装饰工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307120',
    name: '建筑机电安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307130',
    name: '建筑幕墙工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307140',
    name: '古建筑工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307150',
    name: '城市及道路照明工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307160',
    name: '公路路面工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307170',
    name: '公路路基工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307180',
    name: '公路交通工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307181',
    name: '公路交通工程（公路安全设施）专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307182',
    name: '公路交通工程（公路机电工程）专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307190',
    name: '铁路电务工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307200',
    name: '铁路铺轨架梁工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307210',
    name: '铁路电气化工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307220',
    name: '机场场道工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307230',
    name: '民航空管工程及机场弱电系统工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307240',
    name: '机场目视助航工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307250',
    name: '港口与海岸工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307260',
    name: '航道工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307270',
    name: '通航建筑物工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307280',
    name: '港航设备安装及水上交管工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307290',
    name: '水工金属结构制作与安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307300',
    name: '水利水电机电安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307310',
    name: '河湖整治工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307320',
    name: '输变电工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307330',
    name: '核工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307340',
    name: '海洋石油工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307350',
    name: '环保工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307360',
    name: '特种工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307361',
    name: '特种工程(结构补强)专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307362',
    name: '特种工程(建筑物纠偏和平移)专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307363',
    name: '特种工程(特种设备的起重吊装)专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307364',
    name: '特种工程（特种防雷）专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q400000',
    name: '工程监理'
  },
  {
    color: '#43C7C8',
    id: 'Q401000',
    name: '工程监理综合资质'
  },
  {
    color: '#43C7C8',
    id: 'Q402000',
    name: '工程监理专业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q402010',
    name: '工程监理房屋建筑工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402020',
    name: '工程监理冶炼工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402030',
    name: '工程监理矿山工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402040',
    name: '工程监理化工石油工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402050',
    name: '工程监理水利水电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402060',
    name: '工程监理电力工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402070',
    name: '工程监理农林工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402080',
    name: '工程监理铁路工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402090',
    name: '工程监理公路工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402100',
    name: '工程监理港口与航道工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402110',
    name: '工程监理航天航空工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402120',
    name: '工程监理通信工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402130',
    name: '工程监理市政公用工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402140',
    name: '工程监理机电安装工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q403000',
    name: '工程监理事务所资质'
  },
  {
    color: '#43C7C8',
    id: 'Q500000',
    name: '工程招标代理'
  },
  {
    color: '#43C7C8',
    id: 'Q600000',
    name: '设计施工一体化'
  },
  {
    color: '#43C7C8',
    id: 'Q601000',
    name: '建筑智能化工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q602000',
    name: '消防设施工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q603000',
    name: '建筑装饰装修工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q604000',
    name: '建筑幕墙工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q700000',
    name: '工程造价咨询'
  },
  {
    color: '#43C7C8',
    id: '更多...',
    name: '更多...'
  },
  {
    color: '#EDBA34',
    name: '金融',
    id: 'OT01'
  },
  {
    color: '#EDBA34',
    name: '银行',
    id: 'OT0101'
  },
  {
    color: '#EDBA34',
    name: '政策性银行',
    id: 'OT010101'
  },
  {
    color: '#EDBA34',
    name: '六大行',
    id: 'OT010102'
  }, {
    color: '#8074F2',
    name: '农商行',
    id: 'XY060104'
  }, {
    color: '#8074F2',
    name: '城商行',
    id: 'XY060105'
  },
  {
    color: '#EDBA34',
    name: '股份制银行',
    id: 'OT010103'
  },
  {
    color: '#EDBA34',
    name: '农商行',
    id: 'OT010104'
  },
  {
    color: '#EDBA34',
    name: '城商行',
    id: 'OT010105'
  },
  {
    color: '#EDBA34',
    name: '其他银行',
    id: 'OT010199'
  },
  {
    color: '#EDBA34',
    name: '保险',
    id: 'OT0102'
  },
  {
    color: '#EDBA34',
    name: '保险集团',
    id: 'OT010201'
  },
  {
    color: '#EDBA34',
    name: '财险',
    id: 'OT010202'
  },
  {
    color: '#EDBA34',
    name: '寿险',
    id: 'OT010203'
  },
  {
    color: '#EDBA34',
    name: '再保险',
    id: 'OT010204'
  },
  {
    color: '#EDBA34',
    name: '养老险',
    id: 'OT010205'
  },
  {
    color: '#EDBA34',
    name: '健康险',
    id: 'OT010206'
  },
  {
    color: '#EDBA34',
    name: '其他保险',
    id: 'OT010299'
  },
  {
    color: '#EDBA34',
    name: '信用社',
    id: 'OT0103'
  },
  // {
  //   color: '#8074F2',name: '信用社',
  //   id: 'OT010301'
  // },
  {
    color: '#EDBA34',
    name: '证券',
    id: 'OT0104'
  },
  {
    color: '#EDBA34',
    name: '券商',
    id: 'OT010401'
  },
  {
    color: '#EDBA34',
    name: '期货',
    id: 'OT010402'
  },
  {
    color: '#EDBA34',
    name: '其他',
    id: 'OT010499'
  },
  {
    color: '#EDBA34',
    name: '政府',
    id: 'OT02'
  },
  {
    color: '#EDBA34',
    name: '医疗',
    id: 'OT03'
  },
  {
    color: '#EDBA34',
    name: '教育',
    id: 'OT04'
  },
  {
    id: 'P100000',
    name: '系统集成资质',
    color: '#8074F2'
  },
  {
    id: 'P200000',
    name: '运行维护资质',
    color: '#8074F2'
  },
  {
    id: 'XY0101',
    name: '厂商',
    color: '#49C3E5'
  },
  {
    id: 'XY0102',
    name: '经销商',
    color: '#49C3E5'
  },
  {
    id: 'XY0104',
    name: '电商',
    color: '#49C3E5'
  },
  {
    id: 'XY0103',
    name: '品牌',
    color: '#7FC334'
  },
  {
    id: 'XY0201',
    name: '知名',
    color: '#48A4F9'
  },
  {
    id: 'XY0202',
    name: '艾媒金榜',
    color: '#48A4F9'
  },
  {
    id: 'XY0203',
    name: '爱分析',
    color: '#48A4F9'
  },
  {
    id: 'XY0204',
    name: '互联网周刊',
    color: '#48A4F9'
  },
  {
    id: 'XY0205',
    name: 'gartner',
    color: '#48A4F9'
  },
  {
    id: 'XY0301',
    name: '全国性',
    color: '#F39A57'
  },
  {
    id: 'XY0302',
    name: '地域性',
    color: '#F39A57'
  },
  {
    id: 'FW03',
    name: '医疗',
    color: '#35C876'
  },
  {
    id: 'FW0301',
    name: '医疗',
    color: '#35C876'
  },
  {
    id: 'FW02',
    name: '政府',
    color: '#35C876'
  },
  {
    id: 'FW04',
    name: '教育',
    color: '#35C876'
  },
  {
    id: 'FW0401',
    name: '教育',
    color: '#35C876'
  },
  {
    id: 'FW010299',
    name: '其他保险',
    color: '#35C876'
  },
  // {
  //   id: 'FW010301',
  //   name: '信用社',
  //   color: '#35C876',
  // },
  {
    id: 'FW0104',
    name: '证券',
    color: '#35C876'
  },
  {
    id: 'FW010401',
    name: '券商',
    color: '#35C876'
  },
  {
    id: 'FW010499',
    name: '其他',
    color: '#35C876'
  },
  {
    id: 'FW010402',
    name: '期货',
    color: '#35C876'
  },
  {
    id: 'FW010403',
    name: '基金',
    color: '#35C876'
  },
  {
    id: 'FW0103',
    name: '信用社',
    color: '#35C876'
  },
  {
    id: 'FW010206',
    name: '健康险',
    color: '#35C876'
  },
  {
    id: 'FW010205',
    name: '养老险',
    color: '#35C876'
  },
  {
    id: 'FW010204',
    name: '再保险',
    color: '#35C876'
  },
  {
    id: 'FW010203',
    name: '寿险',
    color: '#35C876'
  },
  {
    id: 'FW010202',
    name: '财险',
    color: '#35C876'
  },
  {
    id: 'FW010201',
    name: '保险集团',
    color: '#35C876'
  },
  {
    id: 'FW0102',
    name: '保险',
    color: '#35C876'
  }, {
    id: 'FW01',
    name: '金融',
    color: '#35C876'
  },
  {
    id: 'FW0101',
    name: '银行',
    color: '#35C876'
  },
  {
    id: 'FW010101',
    name: '政策性银行',
    color: '#35C876'
  },
  {
    id: 'FW010102',
    name: '六大行',
    color: '#35C876'
  },
  {
    id: 'FW010103',
    name: '股份制银行',
    color: '#35C876'
  },
  {
    id: 'FW010104',
    name: '农商行',
    color: '#35C876'
  },
  {
    id: 'FW010105',
    name: '城商行',
    color: '#35C876'
  },
  {
    id: 'FW010199',
    name: '其他银行',
    color: '#35C876'
  },
  {
    order: '1',
    id: 'XY0401',
    name: '政府',
    color: '#35C876'
  },
  {
    order: '1',
    id: 'XY0703',
    name: '金额公开',
    color: '#35C876'
  },
  // {
  //   order: '2',
  //   id: 'XY0402',
  //   name: '金融',
  //   color: '#35C876',
  // },
  {
    order: '3',
    id: 'XY0403',
    name: '医疗',
    color: '#35C876'
  },
  {
    order: '4',
    id: 'XY0404',
    name: '教育',
    color: '#35C876'
  },
  {
    id: 'XY0501',
    name: '国有',
    color: '#E27D7D'
  },
  {
    id: 'XY0502',
    name: '外资',
    color: '#E27D7D'
  },
  {
    id: 'XY0503',
    name: '上市',
    color: '#CA82D6'
  },
  {
    id: 'XY0504',
    name: '瞪羚企业',
    color: '#CA82D6'
  },
  {
    id: 'XY0505',
    name: '高新技术企业',
    color: '#CA82D6'
  },
  {
    id: 'XY0507',
    name: '注销',
    color: 'rgba(51,51,51,0.7)'
  },
  {
    id: 'XY0506',
    name: '科技型中小企业',
    color: '#CA82D6'
  },
  {
    id: 'XY0701',
    name: '单一来源',
    color: '#4C66EC'
  },
  {
    id: 'XY0702',
    name: '成交',
    color: '#4C66EC'
  },

  {
    color: '#43C7C8',
    id: 'Q100000',
    name: '工程勘察'
  },
  {
    color: '#43C7C8',
    id: 'Q101000',
    name: '工程勘察综合资质'
  },
  {
    color: '#43C7C8',
    id: 'Q102000',
    name: '工程勘察专业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q102010',
    name: '工程勘察岩土工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102011',
    name: '工程勘察岩土工程专业（岩土工程勘察）'
  },
  {
    color: '#43C7C8',
    id: 'Q102012',
    name: '工程勘察岩土工程专业（岩土工程设计）'
  },
  {
    color: '#43C7C8',
    id: 'Q102013',
    name: '工程勘察岩土工程专业（岩土工程物探测试检测监测）'
  },
  {
    color: '#43C7C8',
    id: 'Q102020',
    name: '工程勘察水文地质勘察专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102030',
    name: '工程勘察工程测量专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102040',
    name: '工程勘察海洋工程勘察专业'
  },
  {
    color: '#43C7C8',
    id: 'Q102041',
    name: '工程勘察海洋工程勘察专业（海洋工程测量）'
  },
  {
    color: '#43C7C8',
    id: 'Q102042',
    name: '工程勘察海洋工程勘察专业（海洋岩土工程勘察）'
  },
  {
    color: '#43C7C8',
    id: 'Q102043',
    name: '工程勘察海洋工程勘察专业（海洋工程环境调查）'
  },
  {
    color: '#43C7C8',
    id: 'Q103000',
    name: '工程勘察劳务资质'
  },
  {
    color: '#43C7C8',
    id: 'Q103010',
    name: '工程勘察工程钻探劳务'
  },
  {
    color: '#43C7C8',
    id: 'Q103020',
    name: '工程勘察凿井劳务'
  },
  {
    color: '#43C7C8',
    id: 'Q200000',
    name: '工程设计'
  },
  {
    color: '#43C7C8',
    id: 'Q201000',
    name: '工程设计综合资质'
  },
  {
    color: '#43C7C8',
    id: 'Q202000',
    name: '工程设计行业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q202010',
    name: '工程设计煤炭行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202020',
    name: '工程设计化工石化医药行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202030',
    name: '工程设计石油天然气（海洋石油）行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202040',
    name: '工程设计电力行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202050',
    name: '工程设计冶金行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202060',
    name: '工程设计军工行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202070',
    name: '工程设计机械行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202080',
    name: '工程设计商物粮行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202090',
    name: '工程设计核工业行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202100',
    name: '工程设计电子通信广电行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202101',
    name: '工程设计电子通信广电行业（电子工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202102',
    name: '工程设计电子通信广电行业（通信工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202103',
    name: '工程设计电子通信广电行业（广电工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202110',
    name: '工程设计轻纺行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202111',
    name: '工程设计轻纺行业（轻工工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202112',
    name: '工程设计轻纺行业（纺织工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202120',
    name: '工程设计建材行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202130',
    name: '工程设计铁道行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202140',
    name: '工程设计公路行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202150',
    name: '工程设计水运行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202160',
    name: '工程设计民航行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202170',
    name: '工程设计市政行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202171',
    name: '工程设计市政行业（燃气工程、轨道交通工程除外）'
  },
  {
    color: '#43C7C8',
    id: 'Q202180',
    name: '工程设计农林行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202181',
    name: '工程设计农林行业（农业工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202182',
    name: '工程设计农林行业（林业工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q202190',
    name: '工程设计水利行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202200',
    name: '工程设计海洋行业'
  },
  {
    color: '#43C7C8',
    id: 'Q202210',
    name: '工程设计建筑行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203000',
    name: '工程设计专业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q203010',
    name: '工程设计煤炭行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203011',
    name: '工程设计煤炭行业矿井专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203012',
    name: '工程设计煤炭行业露天矿专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203013',
    name: '工程设计煤炭行业选煤厂专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203020',
    name: '工程设计化工石化医药行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203021',
    name: '工程设计化工石化医药行业炼油工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203022',
    name: '工程设计化工石化医药行业化工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203023',
    name: '工程设计化工石化医药行业石油及化工产品储运专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203024',
    name: '工程设计化工石化医药行业化工矿山专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203025',
    name: '工程设计化工石化医药行业生化、生物药专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203026',
    name: '工程设计化工石化医药行业中成药专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203027',
    name: '工程设计化工石化医药行业化学原料药专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203028',
    name: '工程设计化工石化医药行业药物制剂专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203029',
    name: '工程设计化工石化医药行业医疗器械（含药品内包装）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203030',
    name: '工程设计石油天然气（海洋石油）行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203031',
    name: '工程设计石油天然气（海洋石油）行业油田地面专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203032',
    name: '工程设计石油天然气（海洋石油）行业气田地面专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203033',
    name: '工程设计石油天然气（海洋石油）行业管道输送专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203034',
    name: '工程设计石油天然气（海洋石油）行业海洋石油专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203035',
    name: '工程设计石油天然气（海洋石油）行业油气库专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203036',
    name: '工程设计石油天然气（海洋石油）行业油气加工专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203037',
    name: '工程设计石油天然气（海洋石油）行业石油机械制造与修理专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203040',
    name: '工程设计电力行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203041',
    name: '工程设计电力行业火力发电（含核电站常规岛设计）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203042',
    name: '工程设计电力行业水力发电（含抽水蓄能、潮汐）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203043',
    name: '工程设计电力行业风力发电专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203044',
    name: '工程设计电力行业送电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203045',
    name: '工程设计电力行业变电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203050',
    name: '工程设计冶金行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203051',
    name: '工程设计冶金行业金属冶炼工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203052',
    name: '工程设计冶金行业金属材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203053',
    name: '工程设计冶金行业焦化和耐火材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203054',
    name: '工程设计冶金行业冶金矿山工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203060',
    name: '工程设计军工行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203061',
    name: '工程设计军工行业导弹及火箭弹工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203062',
    name: '工程设计军工行业弹、火工品及固体发动机工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203063',
    name: '工程设计军工行业燃机、动力装置及航天发动机工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203064',
    name: '工程设计军工行业控制系统、光学、光电、电子、仪表工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203065',
    name: '工程设计军工行业科研、靶场、试验、教育培训工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203066',
    name: '工程设计军工行业地面设备工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203067',
    name: '工程设计军工行业航天空间飞行器工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203068',
    name: '工程设计军工行业运载火箭制造工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203069',
    name: '工程设计军工行业地面制导站工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306A',
    name: '工程设计军工行业航空飞行器工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306B',
    name: '工程设计军工行业机场工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306C',
    name: '工程设计军工行业船舶制造工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306D',
    name: '工程设计军工行业船舶机械工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306E',
    name: '工程设计军工行业船舶水工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306F',
    name: '工程设计军工行业坦克、装甲车辆工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306G',
    name: '工程设计军工行业枪、炮工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20306H',
    name: '工程设计军工行业火、炸药工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203070',
    name: '工程设计机械行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203071',
    name: '工程设计机械行业通用设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203072',
    name: '工程设计机械行业专用设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203073',
    name: '工程设计机械行业交通运输设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203074',
    name: '工程设计机械行业电气机械设备制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203075',
    name: '工程设计机械行业金属制品业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203076',
    name: '工程设计机械行业仪器仪表及文化办公机械制造业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203077',
    name: '工程设计机械行业机械加工专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203078',
    name: '工程设计机械行业热加工专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203079',
    name: '工程设计机械行业表面处理专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20307A',
    name: '工程设计机械行业检测专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20307B',
    name: '工程设计机械行业物料搬运及仓储专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203080',
    name: '工程设计商物粮行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203081',
    name: '工程设计商物粮行业冷冻冷藏工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203082',
    name: '工程设计商物粮行业肉食品加工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203083',
    name: '工程设计商物粮行业批发配送与物流仓储工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203084',
    name: '工程设计商物粮行业成品油储运工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203085',
    name: '工程设计商物粮行业粮食工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203086',
    name: '工程设计商物粮行业油脂工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203090',
    name: '工程设计核工业行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203091',
    name: '工程设计核工业行业反应堆工程设计（含核电站反应堆工程）专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203092',
    name: '工程设计核工业行业核燃料加工制造及处理工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203093',
    name: '工程设计核工业行业铀矿山及选冶工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203094',
    name: '工程设计核工业行业核设施退役及放射性三废处理处置工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203095',
    name: '工程设计核工业行业核技术及同位素应用工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203100',
    name: '工程设计电子通信广电行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203101',
    name: '工程设计电子通信广电行业电子整机产品项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203102',
    name: '工程设计电子通信广电行业电子基础产品项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203103',
    name: '工程设计电子通信广电行业显示器件项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203104',
    name: '工程设计电子通信广电行业微电子产品项目工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203105',
    name: '工程设计电子通信广电行业电子特种环境工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203106',
    name: '工程设计电子通信广电行业电子系统工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203107',
    name: '工程设计电子通信广电行业有线通信专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203108',
    name: '工程设计电子通信广电行业无线通信专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203109',
    name: '工程设计电子通信广电行业邮政工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310A',
    name: '工程设计电子通信广电行业通信铁塔专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310B',
    name: '工程设计电子通信广电行业广播电视中心专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310C',
    name: '工程设计电子通信广电行业广播电视发射专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310D',
    name: '工程设计电子通信广电行业广播电视传输专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310E',
    name: '工程设计电子通信广电行业电影工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310F',
    name: '工程设计电子通信广电行业无线通信专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20310G',
    name: '工程设计电子通信广电行业邮政工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203110',
    name: '工程设计轻纺行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203111',
    name: '工程设计轻纺行业制浆造纸工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203112',
    name: '工程设计轻纺行业食品发酵烟草工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203113',
    name: '工程设计轻纺行业制糖工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203114',
    name: '工程设计轻纺行业日化及塑料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203115',
    name: '工程设计轻纺行业日用硅酸盐工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203116',
    name: '工程设计轻纺行业制盐及盐化工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203117',
    name: '工程设计轻纺行业皮革毛皮及制品专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203118',
    name: '工程设计轻纺行业家电电子及日用机械专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203119',
    name: '工程设计轻纺行业纺织工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311A',
    name: '工程设计轻纺行业印染工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311B',
    name: '工程设计轻纺行业服装工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311C',
    name: '工程设计轻纺行业化纤原料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20311D',
    name: '工程设计轻纺行业化纤工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203120',
    name: '工程设计建材行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203121',
    name: '工程设计建材行业水泥工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203122',
    name: '工程设计建材行业玻璃、陶瓷、耐火材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203123',
    name: '工程设计建材行业新型建筑材料工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203124',
    name: '工程设计建材行业非金属矿及原料制备工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203125',
    name: '工程设计建材行业无机非金属材料及制品工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203130',
    name: '工程设计铁道行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203131',
    name: '工程设计铁道行业桥梁专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203132',
    name: '工程设计铁道行业轨道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203133',
    name: '工程设计铁道行业隧道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203134',
    name: '工程设计铁道行业电气化专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203135',
    name: '工程设计铁道行业通信信号专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203140',
    name: '工程设计公路行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203141',
    name: '工程设计公路行业公路专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203142',
    name: '工程设计公路行业特大桥梁专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203143',
    name: '工程设计公路行业特长隧道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203144',
    name: '工程设计公路行业交通工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203150',
    name: '工程设计水运行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203151',
    name: '工程设计水运行业港口工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203152',
    name: '工程设计水运行业航道工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203153',
    name: '工程设计水运行业通航建筑工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203154',
    name: '工程设计水运行业修造船厂水工工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203155',
    name: '工程设计水运行业港口装卸工艺专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203156',
    name: '工程设计水运行业水上交通管制工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203160',
    name: '工程设计民航行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203161',
    name: '工程设计民航行业机场总体规划工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203162',
    name: '工程设计民航行业场道、目视助航工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203163',
    name: '工程设计民航行业通信、导航、航管及航站楼弱电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203164',
    name: '工程设计民航行业供油工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203170',
    name: '工程设计市政行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203171',
    name: '工程设计市政行业给水工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203172',
    name: '工程设计市政行业排水工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203173',
    name: '工程设计市政行业城镇燃气工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203174',
    name: '工程设计市政行业热力工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203175',
    name: '工程设计市政行业道路工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203176',
    name: '工程设计市政行业桥梁工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203177',
    name: '工程设计市政行业城市隧道工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203178',
    name: '工程设计市政行业公共交通工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203179',
    name: '工程设计市政行业载人索道专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20317A',
    name: '工程设计市政行业轨道交通工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20317B',
    name: '工程设计市政行业环境卫生工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203180',
    name: '工程设计农林行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203181',
    name: '工程设计农林行业农业综合开发生态工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203182',
    name: '工程设计农林行业种植业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203183',
    name: '工程设计农林行业兽医/畜牧工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203184',
    name: '工程设计农林行业渔港/渔业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203185',
    name: '工程设计农林行业设施农业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203186',
    name: '工程设计农林行业林产工业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203187',
    name: '工程设计农林行业林产化学工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203188',
    name: '工程设计农林行业营造林工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203189',
    name: '工程设计农林行业森林资源环境工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q20318A',
    name: '工程设计农林行业森林工业工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203190',
    name: '工程设计水利行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203191',
    name: '工程设计水利行业水库枢纽专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203192',
    name: '工程设计水利行业引调水专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203193',
    name: '工程设计水利行业灌溉排涝专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203194',
    name: '工程设计水利行业河道整治专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203195',
    name: '工程设计水利行业城市防洪专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203196',
    name: '工程设计水利行业围垦专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203197',
    name: '工程设计水利行业水土保 持专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203198',
    name: '工程设计水利行业水文设施专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203200',
    name: '工程设计海洋行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203201',
    name: '工程设计海洋行业沿岸工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203202',
    name: '工程设计海洋行业离岸工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203203',
    name: '工程设计海洋行业海水利用专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203204',
    name: '工程设计海洋行业海洋能利用专业'
  },
  {
    color: '#43C7C8',
    id: 'Q203210',
    name: '工程设计建筑行业'
  },
  {
    color: '#43C7C8',
    id: 'Q203211',
    name: '工程设计建筑行业（建筑工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q203212',
    name: '工程设计建筑行业（人防工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q204000',
    name: '建筑工程设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q204010',
    name: '工程设计建筑设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q204020',
    name: '工程设计结构设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q204030',
    name: '工程设计机电设计事务所'
  },
  {
    color: '#43C7C8',
    id: 'Q205000',
    name: '工程设计专项资质'
  },
  {
    color: '#43C7C8',
    id: 'Q205010',
    name: '工程设计建筑装饰工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205020',
    name: '工程设计建筑智能化系统专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205030',
    name: '工程设计建筑幕墙工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205040',
    name: '工程设计轻型钢结构工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205050',
    name: '工程设计风景园林工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205060',
    name: '工程设计消防设施工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205070',
    name: '工程设计环境工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q205071',
    name: '工程设计环境工程专项（水污染防治工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205072',
    name: '工程设计环境工程专项（大气污染防治工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205073',
    name: '工程设计环境工程专项（固体废物处理处置工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205074',
    name: '工程设计环境工程专项（物理污染防治工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205075',
    name: '工程设计环境工程专项（污染修复工程）'
  },
  {
    color: '#43C7C8',
    id: 'Q205080',
    name: '工程设计照明工程专项'
  },
  {
    color: '#43C7C8',
    id: 'Q300000',
    name: '建筑业企业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q306000',
    name: '施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306010',
    name: '建筑工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306020',
    name: '公路工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306030',
    name: '铁路工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306040',
    name: '港口与航道工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306050',
    name: '水利水电工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306060',
    name: '电力工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306070',
    name: '矿山工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306080',
    name: '冶金工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306090',
    name: '石油化工工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306100',
    name: '市政公用工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306110',
    name: '通信工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q306120',
    name: '机电工程施工总承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307000',
    name: '专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307010',
    name: '地基基础工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307020',
    name: '起重设备安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307030',
    name: '预拌混凝土专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307040',
    name: '电子与智能化工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307050',
    name: '消防设施工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307060',
    name: '防水防腐保温工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307070',
    name: '桥梁工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307080',
    name: '隧道工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307090',
    name: '钢结构工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307100',
    name: '模板脚手架专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307110',
    name: '建筑装修装饰工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307120',
    name: '建筑机电安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307130',
    name: '建筑幕墙工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307140',
    name: '古建筑工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307150',
    name: '城市及道路照明工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307160',
    name: '公路路面工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307170',
    name: '公路路基工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307180',
    name: '公路交通工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307181',
    name: '公路交通工程（公路安全设施）专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307182',
    name: '公路交通工程（公路机电工程）专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307190',
    name: '铁路电务工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307200',
    name: '铁路铺轨架梁工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307210',
    name: '铁路电气化工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307220',
    name: '机场场道工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307230',
    name: '民航空管工程及机场弱电系统工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307240',
    name: '机场目视助航工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307250',
    name: '港口与海岸工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307260',
    name: '航道工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307270',
    name: '通航建筑物工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307280',
    name: '港航设备安装及水上交管工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307290',
    name: '水工金属结构制作与安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307300',
    name: '水利水电机电安装工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307310',
    name: '河湖整治工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307320',
    name: '输变电工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307330',
    name: '核工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307340',
    name: '海洋石油工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307350',
    name: '环保工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307360',
    name: '特种工程专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307361',
    name: '特种工程(结构补强)专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307362',
    name: '特种工程(建筑物纠偏和平移)专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307363',
    name: '特种工程(特种设备的起重吊装)专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q307364',
    name: '特种工程（特种防雷）专业承包'
  },
  {
    color: '#43C7C8',
    id: 'Q400000',
    name: '工程监理'
  },
  {
    color: '#43C7C8',
    id: 'Q401000',
    name: '工程监理综合资质'
  },
  {
    color: '#43C7C8',
    id: 'Q402000',
    name: '工程监理专业资质'
  },
  {
    color: '#43C7C8',
    id: 'Q402010',
    name: '工程监理房屋建筑工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402020',
    name: '工程监理冶炼工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402030',
    name: '工程监理矿山工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402040',
    name: '工程监理化工石油工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402050',
    name: '工程监理水利水电工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402060',
    name: '工程监理电力工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402070',
    name: '工程监理农林工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402080',
    name: '工程监理铁路工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402090',
    name: '工程监理公路工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402100',
    name: '工程监理港口与航道工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402110',
    name: '工程监理航天航空工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402120',
    name: '工程监理通信工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402130',
    name: '工程监理市政公用工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q402140',
    name: '工程监理机电安装工程专业'
  },
  {
    color: '#43C7C8',
    id: 'Q403000',
    name: '工程监理事务所资质'
  },
  {
    color: '#43C7C8',
    id: 'Q500000',
    name: '工程招标代理'
  },
  {
    color: '#43C7C8',
    id: 'Q600000',
    name: '设计施工一体化'
  },
  {
    color: '#43C7C8',
    id: 'Q601000',
    name: '建筑智能化工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q602000',
    name: '消防设施工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q603000',
    name: '建筑装饰装修工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q604000',
    name: '建筑幕墙工程设计与施工'
  },
  {
    color: '#43C7C8',
    id: 'Q700000',
    name: '工程造价咨询'
  },
  {
    color: '#43C7C8',
    id: '更多...',
    name: '更多...'
  }
]
export function getNames(id) {
  let res = ''
  tagConfig.map(item => {
    if (item.id === id) {
      res = item.name
    } else if (id.includes(item.id)) {
      res = item.name
    }
  })
  return res
}
export function getGre(id) {
  let res = ''
  tagConfig.map(item => {
    if (id.includes(item.id)) {
      const g = id.slice(id.length - 1, id.length)
      if (g === '1') {
        res = '特级'
      } else if (g === '2') {
        res = '一级'
      } else if (g === '3') {
        res = '二级'
      } else if (g === '4') {
        res = '三级'
      } else if (g === '5') {
        res = '甲级'
      } else if (g === '6') {
        res = '乙级'
      } else if (g === '7') {
        res = '丙级'
      } else if (g === '8') {
        res = '丁级'
      } else if (g === '9') {
        res = '暂定级'
      } else if (g === 'A') {
        res = '不分等级'
      } else if (g === 'B') {
        res = '甲（Ⅰ）级'
      } else if (g === 'C') {
        res = '甲（Ⅱ）级'
      } else if (g === 'H') {
        res = '四级'
      }
    }
  })
  return res
}
export function getColors(id) {
  let res = ''
  tagConfig.map(item => {
    if (item.id === id) {
      res = item.color
    } else if (id.includes(item.id)) {
      res = item.color
    }
  })
  return res
}
export function getColorsByName(name) {
  let res = ''
  tagConfig.map(item => {
    if (item.name === name) {
      res = item.color
    }
  })
  return res
}
export function getCode(name) {
  let res = ''
  tagConfig.map(item => {
    if (item.name === name) {
      res = item.id
    }
  })
  return res
}
/* export const list_order_by = tagConfig
  .reduce((acc, item) => {
    acc[getValue(item)] = getName(item)
    return acc
  }, {}) */
